espressif/arduino-esp32/libraries/Ethernet/src/ETH.cpp
/*
 ETH.h - espre ETH PHY support.
 Based on WiFi.h from Arduino WiFi shield library.
 Copyright (c) 2011-2014 Arduino.  All right reserved.

 This library is free software; you can redistribute it and/or
 modify it under the terms of the GNU Lesser General Public
 License as published by the Free Software Foundation; either
 version 2.1 of the License, or (at your option) any later version.

 This library is distributed in the hope that it will be useful,
 but WITHOUT ANY WARRANTY; without even the implied warranty of
 MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 Lesser General Public License for more details.

 You should have received a copy of the GNU Lesser General Public
 License along with this library; if not, write to the Free Software
 Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
 */

// Disable the automatic pin remapping of the API calls in this file
#define ARDUINO_CORE_BUILD

#include "ETH.h"
#include "esp_system.h"
#include "esp_event.h"
#include "esp_eth.h"
#include "esp_eth_mac.h"
#include "esp_eth_com.h"
#include "driver/gpio.h"
#include "driver/spi_master.h"
#if CONFIG_ETH_USE_ESP32_EMAC
#include "soc/emac_ext_struct.h"
#include "soc/rtc.h"
#endif /* CONFIG_ETH_USE_ESP32_EMAC */
#include "esp32-hal-periman.h"
#include "lwip/err.h"
#include "lwip/dns.h"
#include "esp_mac.h"
#include "esp_netif.h"
#include "esp_netif_types.h"
#include "esp_netif_defaults.h"
#include "esp_eth_phy.h"

// extern void add_esp_interface_netif(esp_interface_t interface, esp_netif_t* esp_netif); /* from WiFiGeneric */

static ETHClass * _ethernets[3] = { NULL, NULL, NULL };
static esp_event_handler_instance_t _eth_ev_instance = NULL;

static void _eth_event_cb(void* arg, esp_event_base_t event_base, int32_t event_id, void* event_data) {

    if (event_base == ETH_EVENT){
        esp_eth_handle_t eth_handle = *((esp_eth_handle_t*)event_data);
        for(int i = 0; i < 3; ++i){
            if(_ethernets[i] != NULL && _ethernets[i]->handle() == eth_handle){
                _ethernets[i]->_onEthEvent(event_id, event_data);
            }
        }
    }
}

static void onEthConnected(arduino_event_id_t event, arduino_event_info_t info)
{
    if(event == ARDUINO_EVENT_ETH_CONNECTED){
        uint8_t index = 3;
        for (int i = 0; i < 3; ++i) {
            if(_ethernets[i] != NULL && _ethernets[i]->handle() == info.eth_connected){
                index = i;
                break;
            }
        }
        if(index == 3){
            return;
        }
        if (Network.getStatusBits() & ETH_WANT_IP6_BIT(index)){
            esp_err_t err = esp_netif_create_ip6_linklocal(_ethernets[index]->netif());
            if(err != ESP_OK){
                log_e("Failed to enable IPv6 Link Local on ETH: [%d] %s", err, esp_err_to_name(err));
            } else {
                log_v("Enabled IPv6 Link Local on %s", _ethernets[index]->desc());
            }
        }
    }
}

esp_eth_handle_t ETHClass::handle(){
    return _eth_handle;
}

bool ETHClass::connected()
{
    return Network.getStatusBits() & ETH_CONNECTED_BIT(_eth_index);
}

bool ETHClass::started()
{
    return Network.getStatusBits() & ETH_STARTED_BIT(_eth_index);
}

bool ETHClass::enableIPv6(bool en)
{
    // if(_esp_netif == NULL){
    //     return false;
    // }
    if (en) {
        Network.setStatusBits(ETH_WANT_IP6_BIT(_eth_index));
    } else {
        Network.clearStatusBits(ETH_WANT_IP6_BIT(_eth_index));
    }
    return true;
    // return esp_netif_create_ip6_linklocal(_esp_netif) == 0;
}

void ETHClass::_onEthEvent(int32_t event_id, void* event_data){
    arduino_event_t arduino_event;
    arduino_event.event_id = ARDUINO_EVENT_MAX;
    
    if (event_id == ETHERNET_EVENT_CONNECTED) {
        log_v("%s Connected", desc());
        arduino_event.event_id = ARDUINO_EVENT_ETH_CONNECTED;
        arduino_event.event_info.eth_connected = handle();
        Network.setStatusBits(ETH_CONNECTED_BIT(_eth_index));
    } else if (event_id == ETHERNET_EVENT_DISCONNECTED) {
        log_v("%s Disconnected", desc());
        arduino_event.event_id = ARDUINO_EVENT_ETH_DISCONNECTED;
        Network.clearStatusBits(ETH_CONNECTED_BIT(_eth_index) | ETH_HAS_IP_BIT(_eth_index) | ETH_HAS_IP6_BIT(_eth_index));
    } else if (event_id == ETHERNET_EVENT_START) {
        log_v("%s Started", desc());
        arduino_event.event_id = ARDUINO_EVENT_ETH_START;
        Network.setStatusBits(ETH_STARTED_BIT(_eth_index));
    } else if (event_id == ETHERNET_EVENT_STOP) {
        log_v("%s Stopped", desc());
        arduino_event.event_id = ARDUINO_EVENT_ETH_STOP;
        Network.clearStatusBits(ETH_STARTED_BIT(_eth_index) | ETH_CONNECTED_BIT(_eth_index) | ETH_HAS_IP_BIT(_eth_index) | ETH_HAS_IP6_BIT(_eth_index));
    }

    if(arduino_event.event_id < ARDUINO_EVENT_MAX){
        Network.postEvent(&arduino_event);
    }
}

ETHClass::ETHClass(uint8_t eth_index)
    :_eth_handle(NULL)
    ,_eth_index(eth_index)
    ,_phy_type(ETH_PHY_MAX)
#if ETH_SPI_SUPPORTS_CUSTOM
    ,_spi(NULL)
#endif
    ,_spi_freq_mhz(20)
    ,_pin_cs(-1)
    ,_pin_irq(-1)
    ,_pin_rst(-1)
    ,_pin_sck(-1)
    ,_pin_miso(-1)
    ,_pin_mosi(-1)
#if CONFIG_ETH_USE_ESP32_EMAC
    ,_pin_mcd(-1)
    ,_pin_mdio(-1)
    ,_pin_power(-1)
    ,_pin_rmii_clock(-1)
#endif /* CONFIG_ETH_USE_ESP32_EMAC */
{}

ETHClass::~ETHClass()
{}

bool ETHClass::ethDetachBus(void * bus_pointer){
    ETHClass *bus = (ETHClass *) bus_pointer;
    bus->end();
    return true;
}

#if CONFIG_ETH_USE_ESP32_EMAC
bool ETHClass::begin(eth_phy_type_t type, uint8_t phy_addr, int mdc, int mdio, int power, eth_clock_mode_t clock_mode)
{
    esp_err_t ret = ESP_OK;
    if(_eth_index > 2){
        return false;
    }
    if(_esp_netif != NULL){
        return true;
    }
    perimanSetBusDeinit(ESP32_BUS_TYPE_ETHERNET_RMII, ETHClass::ethDetachBus);
    perimanSetBusDeinit(ESP32_BUS_TYPE_ETHERNET_CLK, ETHClass::ethDetachBus);
    perimanSetBusDeinit(ESP32_BUS_TYPE_ETHERNET_MCD, ETHClass::ethDetachBus);
    perimanSetBusDeinit(ESP32_BUS_TYPE_ETHERNET_MDIO, ETHClass::ethDetachBus);
    if(power != -1){
        perimanSetBusDeinit(ESP32_BUS_TYPE_ETHERNET_PWR, ETHClass::ethDetachBus);
    }

    Network.begin();
    _ethernets[_eth_index] = this;
    if(_eth_ev_instance == NULL && esp_event_handler_instance_register(ETH_EVENT, ESP_EVENT_ANY_ID, &_eth_event_cb, NULL, &_eth_ev_instance)){
        log_e("event_handler_instance_register for ETH_EVENT Failed!");
        return false;
    }

