espressif/arduino-esp32/libraries/Ethernet/src/ETH.cpp
    eth_esp32_emac_config_t mac_config = ETH_ESP32_EMAC_DEFAULT_CONFIG();
    mac_config.clock_config.rmii.clock_mode = (clock_mode) ? EMAC_CLK_OUT : EMAC_CLK_EXT_IN;
    mac_config.clock_config.rmii.clock_gpio = (1 == clock_mode) ? EMAC_APPL_CLK_OUT_GPIO : (2 == clock_mode) ? EMAC_CLK_OUT_GPIO : (3 == clock_mode) ? EMAC_CLK_OUT_180_GPIO : EMAC_CLK_IN_GPIO;
    mac_config.smi_mdc_gpio_num = digitalPinToGPIONumber(mdc);
    mac_config.smi_mdio_gpio_num = digitalPinToGPIONumber(mdio);

    _pin_mcd = digitalPinToGPIONumber(mdc);
    _pin_mdio = digitalPinToGPIONumber(mdio);
    _pin_rmii_clock = mac_config.clock_config.rmii.clock_gpio;
    _pin_power = digitalPinToGPIONumber(power);

    if(!perimanClearPinBus(_pin_rmii_clock)){ return false; }
    if(!perimanClearPinBus(_pin_mcd)){ return false; }
    if(!perimanClearPinBus(_pin_mdio)){ return false; }
    if(!perimanClearPinBus(ETH_RMII_TX_EN)){ return false; }
    if(!perimanClearPinBus(ETH_RMII_TX0)){ return false; }
    if(!perimanClearPinBus(ETH_RMII_TX1)){ return false; }
    if(!perimanClearPinBus(ETH_RMII_RX0)){ return false; }
    if(!perimanClearPinBus(ETH_RMII_RX1_EN)){ return false; }
    if(!perimanClearPinBus(ETH_RMII_CRS_DV)){ return false; }
    if(_pin_power != -1){
        if(!perimanClearPinBus(_pin_power)){ return false; }
    }

    eth_mac_config_t eth_mac_config = ETH_MAC_DEFAULT_CONFIG();
    eth_mac_config.sw_reset_timeout_ms = 1000;

    esp_eth_mac_t * mac = esp_eth_mac_new_esp32(&mac_config, &eth_mac_config);
    if(mac == NULL){
        log_e("esp_eth_mac_new_esp32 failed");
        return false;
    }

    eth_phy_config_t phy_config = ETH_PHY_DEFAULT_CONFIG();
    phy_config.phy_addr = phy_addr;
    phy_config.reset_gpio_num = _pin_power;

    esp_eth_phy_t *phy = NULL;
    switch(type){
        case ETH_PHY_LAN8720:
            phy = esp_eth_phy_new_lan87xx(&phy_config);
            break;
        case ETH_PHY_TLK110:
            phy = esp_eth_phy_new_ip101(&phy_config);
            break;
        case ETH_PHY_RTL8201:
            phy = esp_eth_phy_new_rtl8201(&phy_config);
            break;
        case ETH_PHY_DP83848:
            phy = esp_eth_phy_new_dp83848(&phy_config);
            break;
        case ETH_PHY_KSZ8041:
            phy = esp_eth_phy_new_ksz80xx(&phy_config);
            break;
        case ETH_PHY_KSZ8081:
            phy = esp_eth_phy_new_ksz80xx(&phy_config);
            break;
        default:
            log_e("Unsupported PHY %d", type);
            break;
    }
    if(phy == NULL){
        log_e("esp_eth_phy_new failed");
        return false;
    }

    _eth_handle = NULL;
    esp_eth_config_t eth_config = ETH_DEFAULT_CONFIG(mac, phy);
    ret = esp_eth_driver_install(&eth_config, &_eth_handle);
    if(ret != ESP_OK){
        log_e("SPI Ethernet driver install failed: %d", ret);
        return false;
    }
    if(_eth_handle == NULL){
        log_e("esp_eth_driver_install failed! eth_handle is NULL");
        return false;
    }
    
    esp_netif_config_t cfg = ESP_NETIF_DEFAULT_ETH();

    // Use ESP_NETIF_INHERENT_DEFAULT_ETH when multiple Ethernet interfaces are used and so you need to modify
    // esp-netif configuration parameters for each interface (name, priority, etc.).
    char if_key_str[10];
    char if_desc_str[10];
    char num_str[3];
    itoa(_eth_index, num_str, 10);
    if(_eth_index == 0){
        strcpy(if_key_str, "ETH_DEF");
    } else {
        strcat(strcpy(if_key_str, "ETH_"), num_str);
    }
    strcat(strcpy(if_desc_str, "eth"), num_str);

    esp_netif_inherent_config_t esp_netif_config = ESP_NETIF_INHERENT_DEFAULT_ETH();
    esp_netif_config.if_key = if_key_str;
    esp_netif_config.if_desc = if_desc_str;
    esp_netif_config.route_prio -= _eth_index*5;

    cfg.base = &esp_netif_config;

    _esp_netif = esp_netif_new(&cfg);

    /* attach Ethernet driver to TCP/IP stack */
    ret = esp_netif_attach(_esp_netif, esp_eth_new_netif_glue(_eth_handle));
    if(ret != ESP_OK){
        log_e("esp_netif_attach failed: %d", ret);
        return false;
    }

    /* attach to receive events */
    initNetif((ESP_Network_Interface_ID)(ESP_NETIF_ID_ETH+_eth_index));

    ret = esp_eth_start(_eth_handle);
    if(ret != ESP_OK){
        log_e("esp_eth_start failed: %d", ret);
        return false;
    }

    if(!perimanSetPinBus(_pin_rmii_clock, ESP32_BUS_TYPE_ETHERNET_CLK, (void *)(this), -1, -1)){ goto err; }
    if(!perimanSetPinBus(_pin_mcd, ESP32_BUS_TYPE_ETHERNET_MCD, (void *)(this), -1, -1)){ goto err; }
    if(!perimanSetPinBus(_pin_mdio,  ESP32_BUS_TYPE_ETHERNET_MDIO, (void *)(this), -1, -1)){ goto err; }

    if(!perimanSetPinBus(ETH_RMII_TX_EN, ESP32_BUS_TYPE_ETHERNET_RMII, (void *)(this), -1, -1)){ goto err; }
    if(!perimanSetPinBus(ETH_RMII_TX0, ESP32_BUS_TYPE_ETHERNET_RMII, (void *)(this), -1, -1)){ goto err; }
    if(!perimanSetPinBus(ETH_RMII_TX1,  ESP32_BUS_TYPE_ETHERNET_RMII, (void *)(this), -1, -1)){ goto err; }
    if(!perimanSetPinBus(ETH_RMII_RX0, ESP32_BUS_TYPE_ETHERNET_RMII, (void *)(this), -1, -1)){ goto err; }
    if(!perimanSetPinBus(ETH_RMII_RX1_EN, ESP32_BUS_TYPE_ETHERNET_RMII, (void *)(this), -1, -1)){ goto err; }
    if(!perimanSetPinBus(ETH_RMII_CRS_DV,  ESP32_BUS_TYPE_ETHERNET_RMII, (void *)(this), -1, -1)){ goto err; }

    if(_pin_power != -1){
        if(!perimanSetPinBus(_pin_power,  ESP32_BUS_TYPE_ETHERNET_PWR, (void *)(this), -1, -1)){ goto err; }
    }

    Network.onEvent(onEthConnected, ARDUINO_EVENT_ETH_CONNECTED);

    // holds a few milliseconds to let DHCP start and enter into a good state
    // FIX ME -- adresses issue https://github.com/espressif/arduino-esp32/issues/5733
    delay(50);

    return true;

err:
    log_e("Failed to set all pins bus to ETHERNET");
    ETHClass::ethDetachBus((void *)(this));
    return false;
}
#endif /* CONFIG_ETH_USE_ESP32_EMAC */

#if ETH_SPI_SUPPORTS_CUSTOM
static void *_eth_spi_init(const void *ctx){
    return (void*)ctx;
}

static esp_err_t _eth_spi_deinit(void *ctx){
    return ESP_OK;
}

esp_err_t ETHClass::_eth_spi_read(void *ctx, uint32_t cmd, uint32_t addr, void *data, uint32_t data_len){
    return ((ETHClass*)ctx)->eth_spi_read(cmd, addr, data, data_len);
}

