espressif/arduino-esp32/libraries/Ethernet/src/ETH.cpp
    return true;

err:
    log_e("Failed to set all pins bus to ETHERNET");
    ETHClass::ethDetachBus((void *)(this));
    return false;
}

#if ETH_SPI_SUPPORTS_CUSTOM
bool ETHClass::begin(eth_phy_type_t type, uint8_t phy_addr, int cs, int irq, int rst, SPIClass &spi, uint8_t spi_freq_mhz){

    return beginSPI(type, phy_addr, cs, irq, rst, &spi, -1, -1, -1, SPI2_HOST, spi_freq_mhz);
}
#endif

bool ETHClass::begin(eth_phy_type_t type, uint8_t phy_addr, int cs, int irq, int rst, spi_host_device_t spi_host, int sck, int miso, int mosi, uint8_t spi_freq_mhz){

    return beginSPI(type, phy_addr, cs, irq, rst,
#if ETH_SPI_SUPPORTS_CUSTOM 
        NULL, 
#endif
        sck, miso, mosi, spi_host, spi_freq_mhz);
}

void ETHClass::end(void)
{
    destroyNetif();

    if(_eth_handle != NULL){
        if(esp_eth_stop(_eth_handle) != ESP_OK){
            log_e("Failed to stop Ethernet");
            return;
        }
        if(esp_eth_driver_uninstall(_eth_handle) != ESP_OK){
            log_e("Failed to stop Ethernet");
            return;
        }
        _eth_handle = NULL;
    }

#if ETH_SPI_SUPPORTS_CUSTOM
    _spi = NULL;
#endif

#if CONFIG_ETH_USE_ESP32_EMAC
    if(_pin_rmii_clock != -1 && _pin_mcd != -1 && _pin_mdio != -1){
        perimanClearPinBus(_pin_rmii_clock);
        perimanClearPinBus(_pin_mcd);
        perimanClearPinBus(_pin_mdio);

        perimanClearPinBus(ETH_RMII_TX_EN);
        perimanClearPinBus(ETH_RMII_TX0);
        perimanClearPinBus(ETH_RMII_TX1);
        perimanClearPinBus(ETH_RMII_RX0);
        perimanClearPinBus(ETH_RMII_RX1_EN);
        perimanClearPinBus(ETH_RMII_CRS_DV);

        _pin_rmii_clock = -1;
        _pin_mcd = -1;
        _pin_mdio = -1;
    }

    if(_pin_power != -1){
        perimanClearPinBus(_pin_power);
        _pin_power = -1;
    }
#endif /* CONFIG_ETH_USE_ESP32_EMAC */
    if(_pin_cs != -1){
        perimanClearPinBus(_pin_cs);
        _pin_cs = -1;
    }
    if(_pin_irq != -1){
        perimanClearPinBus(_pin_irq);
        _pin_irq = -1;
    }
    if(_pin_sck != -1){
        perimanClearPinBus(_pin_sck);
        _pin_sck = -1;
    }
    if(_pin_miso != -1){
        perimanClearPinBus(_pin_miso);
        _pin_miso = -1;
    }
    if(_pin_mosi != -1){
        perimanClearPinBus(_pin_mosi);
        _pin_mosi = -1;
    }
    if(_pin_rst != -1){
        perimanClearPinBus(_pin_rst);
        _pin_rst = -1;
    }
}

bool ETHClass::fullDuplex()
{
    if(_eth_handle == NULL){
        return false;
    }
    eth_duplex_t link_duplex;
    esp_eth_ioctl(_eth_handle, ETH_CMD_G_DUPLEX_MODE, &link_duplex);
    return (link_duplex == ETH_DUPLEX_FULL);
}

bool ETHClass::autoNegotiation()
{
    if(_eth_handle == NULL){
        return false;
    }
    bool auto_nego;
    esp_eth_ioctl(_eth_handle, ETH_CMD_G_AUTONEGO, &auto_nego);
    return auto_nego;
}

uint32_t ETHClass::phyAddr()
{
    if(_eth_handle == NULL){
        return 0;
    }
    uint32_t phy_addr;
    esp_eth_ioctl(_eth_handle, ETH_CMD_G_PHY_ADDR, &phy_addr);
    return phy_addr;
}

uint8_t ETHClass::linkSpeed()
{
    if(_eth_handle == NULL){
        return 0;
    }
    eth_speed_t link_speed;
    esp_eth_ioctl(_eth_handle, ETH_CMD_G_SPEED, &link_speed);
    return (link_speed == ETH_SPEED_10M)?10:100;
}

// void ETHClass::getMac(uint8_t* mac)
// {
//     if(_eth_handle != NULL && mac != NULL){
//         esp_eth_ioctl(_eth_handle, ETH_CMD_G_MAC_ADDR, mac);
//     }
// }

void ETHClass::printDriverInfo(Print & out){
    out.print(",");
    out.print(linkSpeed());
    out.print("M");
    if(fullDuplex()){
        out.print(",FULL_DUPLEX");
    }
    if(autoNegotiation()){
        out.print(",AUTO");
    }
    out.printf(",ADDR:0x%lX", phyAddr());
}

ETHClass ETH;
